ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR-KV58F220M_SDKv2_FreeRTOS/CMSIS/MKV58F24_features.h
#define FSL_FEATURE_XBARA_INPUT45_ID (Enc0CmpPosMatch)
/* @brief XBARA input 46 ID. */
#define FSL_FEATURE_XBARA_INPUT46_ID (AndOrInvert0)
/* @brief XBARA input 47 ID. */
#define FSL_FEATURE_XBARA_INPUT47_ID (AndOrInvert1)
/* @brief XBARA input 48 ID. */
#define FSL_FEATURE_XBARA_INPUT48_ID (AndOrInvert2)
/* @brief XBARA input 49 ID. */
#define FSL_FEATURE_XBARA_INPUT49_ID (AndOrInvert3)
/* @brief XBARA input 50 ID. */
#define FSL_FEATURE_XBARA_INPUT50_ID (PitTrigger2)
/* @brief XBARA input 51 ID. */
#define FSL_FEATURE_XBARA_INPUT51_ID (PitTrigger3)
/* @brief XBARA input 52 ID. */
#define FSL_FEATURE_XBARA_INPUT52_ID (Pwm1Ch0Trg0OrTrg1)
/* @brief XBARA input 53 ID. */
#define FSL_FEATURE_XBARA_INPUT53_ID (Pwm1Ch1Trg0OrTrg1)
/* @brief XBARA input 54 ID. */
#define FSL_FEATURE_XBARA_INPUT54_ID (Pwm1Ch2Trg0OrTrg1)
/* @brief XBARA input 55 ID. */
#define FSL_FEATURE_XBARA_INPUT55_ID (Pwm1Ch3Trg0OrTrg1)
/* @brief XBARA input 56 ID. */
#define FSL_FEATURE_XBARA_INPUT56_ID (Ftm2Match)
/* @brief XBARA input 57 ID. */
#define FSL_FEATURE_XBARA_INPUT57_ID (Ftm2Extrig)
/* @brief XBARA input 58 ID. */
#define FSL_FEATURE_XBARA_INPUT58_ID (XBARA_IN_RESERVED58)
/* @brief XBARA input 59 ID. */
#define FSL_FEATURE_XBARA_INPUT59_ID (XBARA_IN_RESERVED59)
/* @brief XBARA input 60 ID. */
#define FSL_FEATURE_XBARA_INPUT60_ID (XBARA_IN_RESERVED60)
/* @brief XBARA input 61 ID. */
#define FSL_FEATURE_XBARA_INPUT61_ID (XBARA_IN_RESERVED61)
/* @brief XBARA input 62 ID. */
#define FSL_FEATURE_XBARA_INPUT62_ID (XBARA_IN_RESERVED62)
/* @brief XBARA input 63 ID. */
#define FSL_FEATURE_XBARA_INPUT63_ID (XBARA_IN_RESERVED63)
/* @brief XBARA input 64 ID. */
#define FSL_FEATURE_XBARA_INPUT64_ID (XBARA_IN_RESERVED64)
/* @brief XBARA input 65 ID. */
#define FSL_FEATURE_XBARA_INPUT65_ID (XBARA_IN_RESERVED65)
/* @brief XBARA input 66 ID. */
#define FSL_FEATURE_XBARA_INPUT66_ID (XBARA_IN_RESERVED66)
/* @brief XBARA input 67 ID. */
#define FSL_FEATURE_XBARA_INPUT67_ID (XBARA_IN_RESERVED67)
/* @brief XBARA input 68 ID. */
#define FSL_FEATURE_XBARA_INPUT68_ID (XBARA_IN_RESERVED68)
/* @brief XBARA input 69 ID. */
#define FSL_FEATURE_XBARA_INPUT69_ID (XBARA_IN_RESERVED69)
/* @brief XBARA input 70 ID. */
#define FSL_FEATURE_XBARA_INPUT70_ID (XBARA_IN_RESERVED70)
/* @brief XBARA input 71 ID. */
#define FSL_FEATURE_XBARA_INPUT71_ID (XBARA_IN_RESERVED71)
/* @brief XBARA input 72 ID. */
#define FSL_FEATURE_XBARA_INPUT72_ID (XBARA_IN_RESERVED72)
/* @brief XBARA input 73 ID. */
#define FSL_FEATURE_XBARA_INPUT73_ID (XBARA_IN_RESERVED73)
/* @brief XBARA input 74 ID. */
#define FSL_FEATURE_XBARA_INPUT74_ID (XBARA_IN_RESERVED74)
/* @brief XBARA input 75 ID. */
#define FSL_FEATURE_XBARA_INPUT75_ID (XBARA_IN_RESERVED75)
/* @brief XBARA input 76 ID. */
#define FSL_FEATURE_XBARA_INPUT76_ID (XBARA_IN_RESERVED76)
/* @brief XBARA input 77 ID. */
#define FSL_FEATURE_XBARA_INPUT77_ID (XBARA_IN_RESERVED77)
/* @brief XBARA input 78 ID. */
#define FSL_FEATURE_XBARA_INPUT78_ID (XBARA_IN_RESERVED78)
/* @brief XBARA input 79 ID. */
#define FSL_FEATURE_XBARA_INPUT79_ID (XBARA_IN_RESERVED79)
/* @brief XBARA input 80 ID. */
#define FSL_FEATURE_XBARA_INPUT80_ID (XBARA_IN_RESERVED80)
/* @brief XBARA input 81 ID. */
#define FSL_FEATURE_XBARA_INPUT81_ID (XBARA_IN_RESERVED81)
/* @brief XBARA input 82 ID. */
#define FSL_FEATURE_XBARA_INPUT82_ID (XBARA_IN_RESERVED82)
/* @brief XBARA input 83 ID. */
#define FSL_FEATURE_XBARA_INPUT83_ID (XBARA_IN_RESERVED83)
/* @brief XBARA input 84 ID. */
#define FSL_FEATURE_XBARA_INPUT84_ID (XBARA_IN_RESERVED84)
/* @brief XBARA input 85 ID. */
#define FSL_FEATURE_XBARA_INPUT85_ID (XBARA_IN_RESERVED85)
/* @brief XBARA input 86 ID. */
#define FSL_FEATURE_XBARA_INPUT86_ID (XBARA_IN_RESERVED86)
/* @brief XBARA input 87 ID. */
#define FSL_FEATURE_XBARA_INPUT87_ID (XBARA_IN_RESERVED87)
/* @brief XBARA input 88 ID. */
#define FSL_FEATURE_XBARA_INPUT88_ID (XBARA_IN_RESERVED88)
/* @brief XBARA input 89 ID. */
#define FSL_FEATURE_XBARA_INPUT89_ID (XBARA_IN_RESERVED89)
/* @brief XBARA input 90 ID. */
#define FSL_FEATURE_XBARA_INPUT90_ID (XBARA_IN_RESERVED90)
/* @brief XBARA input 91 ID. */
#define FSL_FEATURE_XBARA_INPUT91_ID (XBARA_IN_RESERVED91)
/* @brief XBARA input 92 ID. */
#define FSL_FEATURE_XBARA_INPUT92_ID (XBARA_IN_RESERVED92)
/* @brief XBARA input 93 ID. */
#define FSL_FEATURE_XBARA_INPUT93_ID (XBARA_IN_RESERVED93)
/* @brief XBARA input 94 ID. */
#define FSL_FEATURE_XBARA_INPUT94_ID (XBARA_IN_RESERVED94)
/* @brief XBARA input 95 ID. */
#define FSL_FEATURE_XBARA_INPUT95_ID (XBARA_IN_RESERVED95)
/* @brief XBARA input 96 ID. */
#define FSL_FEATURE_XBARA_INPUT96_ID (XBARA_IN_RESERVED96)
/* @brief XBARA input 97 ID. */
#define FSL_FEATURE_XBARA_INPUT97_ID (XBARA_IN_RESERVED97)
/* @brief XBARA input 98 ID. */
#define FSL_FEATURE_XBARA_INPUT98_ID (XBARA_IN_RESERVED98)
/* @brief XBARA input 99 ID. */
#define FSL_FEATURE_XBARA_INPUT99_ID (XBARA_IN_RESERVED99)
/* @brief XBARA input 100 ID. */
#define FSL_FEATURE_XBARA_INPUT100_ID (XBARA_IN_RESERVED100)
/* @brief XBARA input 101 ID. */
#define FSL_FEATURE_XBARA_INPUT101_ID (XBARA_IN_RESERVED101)
/* @brief XBARA input 102 ID. */
#define FSL_FEATURE_XBARA_INPUT102_ID (XBARA_IN_RESERVED102)
/* @brief XBARA input 103 ID. */
#define FSL_FEATURE_XBARA_INPUT103_ID (XBARA_IN_RESERVED103)
/* @brief XBARA input 104 ID. */
#define FSL_FEATURE_XBARA_INPUT104_ID (XBARA_IN_RESERVED104)
/* @brief XBARA input 105 ID. */
#define FSL_FEATURE_XBARA_INPUT105_ID (XBARA_IN_RESERVED105)
/* @brief XBARA input 106 ID. */
#define FSL_FEATURE_XBARA_INPUT106_ID (XBARA_IN_RESERVED106)
/* @brief XBARA input 107 ID. */
#define FSL_FEATURE_XBARA_INPUT107_ID (XBARA_IN_RESERVED107)
/* @brief XBARA input 108 ID. */
#define FSL_FEATURE_XBARA_INPUT108_ID (XBARA_IN_RESERVED108)
/* @brief XBARA input 109 ID. */
#define FSL_FEATURE_XBARA_INPUT109_ID (XBARA_IN_RESERVED109)
/* @brief XBARA input 110 ID. */
#define FSL_FEATURE_XBARA_INPUT110_ID (XBARA_IN_RESERVED110)
/* @brief XBARA input 111 ID. */
#define FSL_FEATURE_XBARA_INPUT111_ID (XBARA_IN_RESERVED111)
/* @brief XBARA input 112 ID. */
#define FSL_FEATURE_XBARA_INPUT112_ID (XBARA_IN_RESERVED112)
/* @brief XBARA input 113 ID. */
#define FSL_FEATURE_XBARA_INPUT113_ID (XBARA_IN_RESERVED113)
/* @brief XBARA input 114 ID. */
#define FSL_FEATURE_XBARA_INPUT114_ID (XBARA_IN_RESERVED114)
/* @brief XBARA input 115 ID. */
#define FSL_FEATURE_XBARA_INPUT115_ID (XBARA_IN_RESERVED115)
/* @brief XBARA input 116 ID. */
#define FSL_FEATURE_XBARA_INPUT116_ID (XBARA_IN_RESERVED116)
/* @brief XBARA input 117 ID. */
#define FSL_FEATURE_XBARA_INPUT117_ID (XBARA_IN_RESERVED117)
/* @brief XBARA input 118 ID. */
#define FSL_FEATURE_XBARA_INPUT118_ID (XBARA_IN_RESERVED118)
/* @brief XBARA input 119 ID. */
#define FSL_FEATURE_XBARA_INPUT119_ID (XBARA_IN_RESERVED119)
/* @brief XBARA input 120 ID. */
#define FSL_FEATURE_XBARA_INPUT120_ID (XBARA_IN_RESERVED120)
/* @brief XBARA input 121 ID. */
#define FSL_FEATURE_XBARA_INPUT121_ID (XBARA_IN_RESERVED121)
/* @brief XBARA input 122 ID. */
#define FSL_FEATURE_XBARA_INPUT122_ID (XBARA_IN_RESERVED122)
/* @brief XBARA input 123 ID. */
#define FSL_FEATURE_XBARA_INPUT123_ID (XBARA_IN_RESERVED123)
/* @brief XBARA input 124 ID. */
#define FSL_FEATURE_XBARA_INPUT124_ID (XBARA_IN_RESERVED124)
/* @brief XBARA input 125 ID. */
#define FSL_FEATURE_XBARA_INPUT125_ID (XBARA_IN_RESERVED125)
/* @brief XBARA input 126 ID. */
#define FSL_FEATURE_XBARA_INPUT126_ID (XBARA_IN_RESERVED126)
/* @brief XBARA input 127 ID. */
#define FSL_FEATURE_XBARA_INPUT127_ID (XBARA_IN_RESERVED127)
/* @brief XBARA output 0 ID. */
#define FSL_FEATURE_XBARA_OUTPUT0_ID (Dmamux18)
/* @brief XBARA output 1 ID. */
#define FSL_FEATURE_XBARA_OUTPUT1_ID (Dmamux19)
/* @brief XBARA output 2 ID. */
#define FSL_FEATURE_XBARA_OUTPUT2_ID (Dmamux20)
/* @brief XBARA output 3 ID. */
#define FSL_FEATURE_XBARA_OUTPUT3_ID (Dmamux21)
/* @brief XBARA output 4 ID. */
#define FSL_FEATURE_XBARA_OUTPUT4_ID (XbOut4)
/* @brief XBARA output 5 ID. */
#define FSL_FEATURE_XBARA_OUTPUT5_ID (XbOut5)
/* @brief XBARA output 6 ID. */
#define FSL_FEATURE_XBARA_OUTPUT6_ID (XbOut6)
/* @brief XBARA output 7 ID. */
#define FSL_FEATURE_XBARA_OUTPUT7_ID (XbOut7)
/* @brief XBARA output 8 ID. */
#define FSL_FEATURE_XBARA_OUTPUT8_ID (XbOut8)
/* @brief XBARA output 9 ID. */
#define FSL_FEATURE_XBARA_OUTPUT9_ID (XbOut9)
/* @brief XBARA output 10 ID. */
#define FSL_FEATURE_XBARA_OUTPUT10_ID (XbOut10)
/* @brief XBARA output 11 ID. */
#define FSL_FEATURE_XBARA_OUTPUT11_ID (XbOut11)
/* @brief XBARA output 12 ID. */
#define FSL_FEATURE_XBARA_OUTPUT12_ID (Hsadc0ATrig)
/* @brief XBARA output 13 ID. */
#define FSL_FEATURE_XBARA_OUTPUT13_ID (Hsadc0BTrig)
/* @brief XBARA output 14 ID. */
#define FSL_FEATURE_XBARA_OUTPUT14_ID (XBARA_OUT_RESERVED14)
/* @brief XBARA output 15 ID. */
#define FSL_FEATURE_XBARA_OUTPUT15_ID (Dac12bSync)
/* @brief XBARA output 16 ID. */
#define FSL_FEATURE_XBARA_OUTPUT16_ID (Cmp0)
/* @brief XBARA output 17 ID. */
#define FSL_FEATURE_XBARA_OUTPUT17_ID (Cmp1)
/* @brief XBARA output 18 ID. */
#define FSL_FEATURE_XBARA_OUTPUT18_ID (Cmp2)
/* @brief XBARA output 19 ID. */
#define FSL_FEATURE_XBARA_OUTPUT19_ID (Cmp3)
/* @brief XBARA output 20 ID. */
#define FSL_FEATURE_XBARA_OUTPUT20_ID (PwmCh0ExtA)
/* @brief XBARA output 21 ID. */
#define FSL_FEATURE_XBARA_OUTPUT21_ID (PwmCh1ExtA)
/* @brief XBARA output 22 ID. */
#define FSL_FEATURE_XBARA_OUTPUT22_ID (PwmCh2ExtA)
/* @brief XBARA output 23 ID. */
#define FSL_FEATURE_XBARA_OUTPUT23_ID (PwmCh3ExtA)
/* @brief XBARA output 24 ID. */
#define FSL_FEATURE_XBARA_OUTPUT24_ID (Pwm0Ch0ExtSync)
/* @brief XBARA output 25 ID. */
#define FSL_FEATURE_XBARA_OUTPUT25_ID (Pwm0Ch1ExtSync)
/* @brief XBARA output 26 ID. */
#define FSL_FEATURE_XBARA_OUTPUT26_ID (Pwm0Ch2ExtSync)
/* @brief XBARA output 27 ID. */
#define FSL_FEATURE_XBARA_OUTPUT27_ID (Pwm0Ch3ExtSync)
/* @brief XBARA output 28 ID. */
#define FSL_FEATURE_XBARA_OUTPUT28_ID (PwmExtClk)
/* @brief XBARA output 29 ID. */
#define FSL_FEATURE_XBARA_OUTPUT29_ID (Pwm0Fault0)
/* @brief XBARA output 30 ID. */
#define FSL_FEATURE_XBARA_OUTPUT30_ID (Pwm0Fault1)
/* @brief XBARA output 31 ID. */
#define FSL_FEATURE_XBARA_OUTPUT31_ID (Pwm0Fault2)
/* @brief XBARA output 32 ID. */
#define FSL_FEATURE_XBARA_OUTPUT32_ID (Pwm0Fault3)
/* @brief XBARA output 33 ID. */
#define FSL_FEATURE_XBARA_OUTPUT33_ID (Pwm0Force)
/* @brief XBARA output 34 ID. */
#define FSL_FEATURE_XBARA_OUTPUT34_ID (Ftm0Trig2)
/* @brief XBARA output 35 ID. */
#define FSL_FEATURE_XBARA_OUTPUT35_ID (Ftm1Trig2)
/* @brief XBARA output 36 ID. */
#define FSL_FEATURE_XBARA_OUTPUT36_ID (Ftm2Trig2)
/* @brief XBARA output 37 ID. */
#define FSL_FEATURE_XBARA_OUTPUT37_ID (Ftm3Trig2)
/* @brief XBARA output 38 ID. */
#define FSL_FEATURE_XBARA_OUTPUT38_ID (Pdb0InCh12)
/* @brief XBARA output 39 ID. */
#define FSL_FEATURE_XBARA_OUTPUT39_ID (Adc0Hdwt)
/* @brief XBARA output 40 ID. */
#define FSL_FEATURE_XBARA_OUTPUT40_ID (XBARA_OUT_RESERVED40)
/* @brief XBARA output 41 ID. */
#define FSL_FEATURE_XBARA_OUTPUT41_ID (Pdb1InCh12)
/* @brief XBARA output 42 ID. */
#define FSL_FEATURE_XBARA_OUTPUT42_ID (Hsadc1ATrig)
/* @brief XBARA output 43 ID. */
#define FSL_FEATURE_XBARA_OUTPUT43_ID (Hsadc1BTrig)
/* @brief XBARA output 44 ID. */
#define FSL_FEATURE_XBARA_OUTPUT44_ID (EncPhA)
/* @brief XBARA output 45 ID. */
#define FSL_FEATURE_XBARA_OUTPUT45_ID (EncPhB)
/* @brief XBARA output 46 ID. */
#define FSL_FEATURE_XBARA_OUTPUT46_ID (EncIndex)
/* @brief XBARA output 47 ID. */
#define FSL_FEATURE_XBARA_OUTPUT47_ID (EncHome)
/* @brief XBARA output 48 ID. */
#define FSL_FEATURE_XBARA_OUTPUT48_ID (EncCapTrigger)
/* @brief XBARA output 49 ID. */
#define FSL_FEATURE_XBARA_OUTPUT49_ID (Ftm0Fault3)
/* @brief XBARA output 50 ID. */
#define FSL_FEATURE_XBARA_OUTPUT50_ID (Ftm1Fault1)
/* @brief XBARA output 51 ID. */
#define FSL_FEATURE_XBARA_OUTPUT51_ID (Ftm2Fault1)
/* @brief XBARA output 52 ID. */
#define FSL_FEATURE_XBARA_OUTPUT52_ID (Ftm3Fault3)
/* @brief XBARA output 53 ID. */
#define FSL_FEATURE_XBARA_OUTPUT53_ID (Pwm1Ch0ExtSync)
/* @brief XBARA output 54 ID. */
#define FSL_FEATURE_XBARA_OUTPUT54_ID (Pwm1Ch1ExtSync)
/* @brief XBARA output 55 ID. */
#define FSL_FEATURE_XBARA_OUTPUT55_ID (Pwm1Ch2ExtSync)
/* @brief XBARA output 56 ID. */
#define FSL_FEATURE_XBARA_OUTPUT56_ID (Pwm1Ch3ExtSync)
/* @brief XBARA output 57 ID. */
#define FSL_FEATURE_XBARA_OUTPUT57_ID (Pwm1Force)
/* @brief XBARA output 58 ID. */
#define FSL_FEATURE_XBARA_OUTPUT58_ID (EwmIn)
/* @brief XBARA output 59 ID. */
#define FSL_FEATURE_XBARA_OUTPUT59_ID (XBARA_OUT_RESERVED59)
/* @brief XBARA output 60 ID. */
#define FSL_FEATURE_XBARA_OUTPUT60_ID (XBARA_OUT_RESERVED60)
/* @brief XBARA output 61 ID. */
#define FSL_FEATURE_XBARA_OUTPUT61_ID (XBARA_OUT_RESERVED61)
/* @brief XBARA output 62 ID. */
#define FSL_FEATURE_XBARA_OUTPUT62_ID (XBARA_OUT_RESERVED62)
/* @brief XBARA output 63 ID. */
#define FSL_FEATURE_XBARA_OUTPUT63_ID (XBARA_OUT_RESERVED63)
/* @brief XBARA output 64 ID. */
#define FSL_FEATURE_XBARA_OUTPUT64_ID (XBARA_OUT_RESERVED64)
/* @brief XBARA output 65 ID. */
#define FSL_FEATURE_XBARA_OUTPUT65_ID (XBARA_OUT_RESERVED65)
/* @brief XBARA output 66 ID. */
#define FSL_FEATURE_XBARA_OUTPUT66_ID (XBARA_OUT_RESERVED66)
/* @brief XBARA output 67 ID. */
#define FSL_FEATURE_XBARA_OUTPUT67_ID (XBARA_OUT_RESERVED67)
/* @brief XBARA output 68 ID. */
#define FSL_FEATURE_XBARA_OUTPUT68_ID (XBARA_OUT_RESERVED68)
/* @brief XBARA output 69 ID. */
#define FSL_FEATURE_XBARA_OUTPUT69_ID (XBARA_OUT_RESERVED69)
/* @brief XBARA output 70 ID. */
#define FSL_FEATURE_XBARA_OUTPUT70_ID (XBARA_OUT_RESERVED70)
/* @brief XBARA output 71 ID. */
#define FSL_FEATURE_XBARA_OUTPUT71_ID (XBARA_OUT_RESERVED71)
/* @brief XBARA output 72 ID. */
#define FSL_FEATURE_XBARA_OUTPUT72_ID (XBARA_OUT_RESERVED72)
/* @brief XBARA output 73 ID. */
#define FSL_FEATURE_XBARA_OUTPUT73_ID (XBARA_OUT_RESERVED73)
/* @brief XBARA output 74 ID. */
#define FSL_FEATURE_XBARA_OUTPUT74_ID (XBARA_OUT_RESERVED74)
/* @brief XBARA output 75 ID. */
#define FSL_FEATURE_XBARA_OUTPUT75_ID (XBARA_OUT_RESERVED75)
/* @brief XBARA output 76 ID. */
#define FSL_FEATURE_XBARA_OUTPUT76_ID (XBARA_OUT_RESERVED76)
/* @brief XBARA output 77 ID. */
#define FSL_FEATURE_XBARA_OUTPUT77_ID (XBARA_OUT_RESERVED77)
/* @brief XBARA output 78 ID. */
#define FSL_FEATURE_XBARA_OUTPUT78_ID (XBARA_OUT_RESERVED78)
/* @brief XBARA output 79 ID. */
#define FSL_FEATURE_XBARA_OUTPUT79_ID (XBARA_OUT_RESERVED79)
/* @brief XBARA output 80 ID. */
#define FSL_FEATURE_XBARA_OUTPUT80_ID (XBARA_OUT_RESERVED80)
/* @brief XBARA output 81 ID. */
#define FSL_FEATURE_XBARA_OUTPUT81_ID (XBARA_OUT_RESERVED81)
/* @brief XBARA output 82 ID. */
#define FSL_FEATURE_XBARA_OUTPUT82_ID (XBARA_OUT_RESERVED82)
/* @brief XBARA output 83 ID. */
#define FSL_FEATURE_XBARA_OUTPUT83_ID (XBARA_OUT_RESERVED83)
/* @brief XBARA output 84 ID. */
#define FSL_FEATURE_XBARA_OUTPUT84_ID (XBARA_OUT_RESERVED84)
/* @brief XBARA output 85 ID. */
#define FSL_FEATURE_XBARA_OUTPUT85_ID (XBARA_OUT_RESERVED85)
/* @brief XBARA output 86 ID. */
#define FSL_FEATURE_XBARA_OUTPUT86_ID (XBARA_OUT_RESERVED86)
/* @brief XBARA output 87 ID. */
#define FSL_FEATURE_XBARA_OUTPUT87_ID (XBARA_OUT_RESERVED87)
/* @brief XBARA output 88 ID. */
#define FSL_FEATURE_XBARA_OUTPUT88_ID (XBARA_OUT_RESERVED88)
/* @brief XBARA output 89 ID. */
#define FSL_FEATURE_XBARA_OUTPUT89_ID (XBARA_OUT_RESERVED89)
/* @brief XBARA output 90 ID. */
#define FSL_FEATURE_XBARA_OUTPUT90_ID (XBARA_OUT_RESERVED90)
/* @brief XBARA output 91 ID. */
#define FSL_FEATURE_XBARA_OUTPUT91_ID (XBARA_OUT_RESERVED91)
/* @brief XBARA output 92 ID. */
#define FSL_FEATURE_XBARA_OUTPUT92_ID (XBARA_OUT_RESERVED92)
/* @brief XBARA output 93 ID. */
#define FSL_FEATURE_XBARA_OUTPUT93_ID (XBARA_OUT_RESERVED93)
/* @brief XBARA output 94 ID. */
#define FSL_FEATURE_XBARA_OUTPUT94_ID (XBARA_OUT_RESERVED94)
/* @brief XBARA output 95 ID. */
#define FSL_FEATURE_XBARA_OUTPUT95_ID (XBARA_OUT_RESERVED95)
/* @brief XBARA output 96 ID. */
#define FSL_FEATURE_XBARA_OUTPUT96_ID (XBARA_OUT_RESERVED96)
/* @brief XBARA output 97 ID. */
#define FSL_FEATURE_XBARA_OUTPUT97_ID (XBARA_OUT_RESERVED97)
/* @brief XBARA output 98 ID. */
#define FSL_FEATURE_XBARA_OUTPUT98_ID (XBARA_OUT_RESERVED98)
/* @brief XBARA output 99 ID. */
#define FSL_FEATURE_XBARA_OUTPUT99_ID (XBARA_OUT_RESERVED99)
/* @brief XBARA output 100 ID. */
#define FSL_FEATURE_XBARA_OUTPUT100_ID (XBARA_OUT_RESERVED100)
/* @brief XBARA output 101 ID. */
#define FSL_FEATURE_XBARA_OUTPUT101_ID (XBARA_OUT_RESERVED101)
/* @brief XBARA output 102 ID. */
#define FSL_FEATURE_XBARA_OUTPUT102_ID (XBARA_OUT_RESERVED102)
/* @brief XBARA output 103 ID. */
#define FSL_FEATURE_XBARA_OUTPUT103_ID (XBARA_OUT_RESERVED103)
/* @brief XBARA output 104 ID. */
#define FSL_FEATURE_XBARA_OUTPUT104_ID (XBARA_OUT_RESERVED104)
/* @brief XBARA output 105 ID. */
#define FSL_FEATURE_XBARA_OUTPUT105_ID (XBARA_OUT_RESERVED105)
/* @brief XBARA output 106 ID. */
#define FSL_FEATURE_XBARA_OUTPUT106_ID (XBARA_OUT_RESERVED106)
/* @brief XBARA output 107 ID. */
#define FSL_FEATURE_XBARA_OUTPUT107_ID (XBARA_OUT_RESERVED107)
/* @brief XBARA output 108 ID. */
#define FSL_FEATURE_XBARA_OUTPUT108_ID (XBARA_OUT_RESERVED108)
/* @brief XBARA output 109 ID. */
#define FSL_FEATURE_XBARA_OUTPUT109_ID (XBARA_OUT_RESERVED109)
/* @brief XBARA output 110 ID. */
#define FSL_FEATURE_XBARA_OUTPUT110_ID (XBARA_OUT_RESERVED110)
/* @brief XBARA output 111 ID. */
#define FSL_FEATURE_XBARA_OUTPUT111_ID (XBARA_OUT_RESERVED111)
/* @brief XBARA output 112 ID. */
#define FSL_FEATURE_XBARA_OUTPUT112_ID (XBARA_OUT_RESERVED112)
/* @brief XBARA output 113 ID. */
#define FSL_FEATURE_XBARA_OUTPUT113_ID (XBARA_OUT_RESERVED113)
/* @brief XBARA output 114 ID. */
#define FSL_FEATURE_XBARA_OUTPUT114_ID (XBARA_OUT_RESERVED114)
/* @brief XBARA output 115 ID. */
#define FSL_FEATURE_XBARA_OUTPUT115_ID (XBARA_OUT_RESERVED115)
/* @brief XBARA output 116 ID. */
#define FSL_FEATURE_XBARA_OUTPUT116_ID (XBARA_OUT_RESERVED116)
/* @brief XBARA output 117 ID. */
#define FSL_FEATURE_XBARA_OUTPUT117_ID (XBARA_OUT_RESERVED117)
/* @brief XBARA output 118 ID. */
#define FSL_FEATURE_XBARA_OUTPUT118_ID (XBARA_OUT_RESERVED118)
/* @brief XBARA output 119 ID. */
#define FSL_FEATURE_XBARA_OUTPUT119_ID (XBARA_OUT_RESERVED119)
/* @brief XBARA output 120 ID. */
#define FSL_FEATURE_XBARA_OUTPUT120_ID (XBARA_OUT_RESERVED120)
/* @brief XBARA output 121 ID. */
#define FSL_FEATURE_XBARA_OUTPUT121_ID (XBARA_OUT_RESERVED121)
/* @brief XBARA output 122 ID. */
#define FSL_FEATURE_XBARA_OUTPUT122_ID (XBARA_OUT_RESERVED122)
/* @brief XBARA output 123 ID. */
#define FSL_FEATURE_XBARA_OUTPUT123_ID (XBARA_OUT_RESERVED123)
/* @brief XBARA output 124 ID. */
#define FSL_FEATURE_XBARA_OUTPUT124_ID (XBARA_OUT_RESERVED124)
/* @brief XBARA output 125 ID. */
#define FSL_FEATURE_XBARA_OUTPUT125_ID (XBARA_OUT_RESERVED125)
/* @brief XBARA output 126 ID. */
#define FSL_FEATURE_XBARA_OUTPUT126_ID (XBARA_OUT_RESERVED126)
/* @brief XBARA output 127 ID. */
#define FSL_FEATURE_XBARA_OUTPUT127_ID (XBARA_OUT_RESERVED127)

/* XBARB module features */

